SPOOL C:\test.csv

--タイトル行や一行当たりの文字数を設定する
set pagesize 0
set linesize 32767
set trimspool on
set feedback off
--set verify off
set long 32767
set longchunksize 32767
set head on
SET UNDERLINE OFF 
SET verify off
SET echo off
SET TERMOUT OFF

SELECT
TO_CLOB('"') || 	'〒'
    || '","' || 	'差異'
    || '","' || 	'明細書'
    || '","' || 	'残高確認書指定区分'
    || '","' || 	'確認書№'
    || '","' || 	'注文主コード'
    || '","' || 	'注文主会社コード'
    || '","' || 	'注文主名称漢字'
    || '","' || 	'受注元コード'
    || '","' || 	'受注元名称'
    || '","' || 	'事業部コード'
    || '","' || 	'カンパニー名称'
    || '","' || 	'当月末合計残高'
    || '","' || 	'郵便番号'
    || '","' || 	'送り先住所'
    || '","' || 	'宛名'
    || '"'
	FROM
DB_1.V_CONF_L CONFIRM
JOIN DB_1.V_CO_B_K BRANCH ON CONFIRM.注文主コード = BRANCH.取引先コード
and CONFIRM.統計年月 = '&1'
and CONFIRM.売掛金邦貨合計残高 <> 0
WHERE ROWNUM <= 1
union all
SELECT
	-- 〒********************************
--TO_CLOB('"') || 	''as "〒"
TO_CLOB('"') || 	''
 	-- 差異********************************
    || '","' || 	''
 	-- 明細書********************************
    || '","' || 	''
 	-- 残高確認書指定区分********************************
    || '","' || 	残高確認書指定区分 
 	-- 確認書№********************************
    || '","' || 	残高確認書ＮＯ 
 	-- 注文主コード********************************
    || '","' || 	注文主コード
 	-- 注文主会社コード********************************
    || '","' || 	注文主会社コード 
 	-- 注文主名称漢字********************************
    || '","' || 	concat(concat(注文主会社名称漢字, ' '), 注文主事業所名称漢字) 
 	-- 受注元コード********************************
    || '","' || 	受注元コード 
 	-- 受注元名称********************************
    || '","' || 	受注元名称 
 	-- 事業部コード********************************
    || '","' || 	事業部コード
 	-- カンパニー名称********************************
    || '","' || 	カンパニー名称 
 	-- 当月末合計残高********************************
    || '","' || 	sum(売掛金邦貨合計残高) 
 	-- 郵便番号********************************
    || '","' || 	concat(concat(SUBSTR ( 郵便番号 , 1 , 3 ), '-'), SUBSTR ( 郵便番号 , 4 , 4 )) 
 	-- 送り先住所********************************
    || '","' || 	住所漢字 
 	-- 宛名********************************
    || '","' || 	''
--    || '","' || 	統計年月
    || '"'
FROM
DB_1.V_CONF_L CONFIRM
JOIN DB_1.V_CO_B_K BRANCH ON CONFIRM.注文主コード = BRANCH.取引先コード
and CONFIRM.統計年月 = '&1'
and CONFIRM.売掛金邦貨合計残高 <> 0
and CONFIRM.残高確認書指定区分 = '1'
group by(
'〒'
,'差異'
,'明細書'
,CONFIRM.残高確認書指定区分
,CONFIRM.残高確認書ＮＯ
,CONFIRM.注文主コード
,CONFIRM.注文主会社コード
,concat(concat(CONFIRM.注文主会社名称漢字, ' '), CONFIRM.注文主事業所名称漢字)
,CONFIRM.受注元コード
,CONFIRM.受注元名称
,CONFIRM.事業部コード
,CONFIRM.カンパニー名称
,concat(concat(SUBSTR ( BRANCH.郵便番号 , 1 , 3 ), '-'), SUBSTR ( BRANCH.郵便番号 , 4 , 4 ))
,BRANCH.住所漢字
,'宛名'
--,統計年月
)
union all
SELECT
	-- 〒********************************
--TO_CLOB('"') || 	''as "〒"
TO_CLOB('"') || 	''
 	-- 差異********************************
    || '","' || 	''
 	-- 明細書********************************
    || '","' || 	''
 	-- 残高確認書指定区分********************************
    || '","' || 	残高確認書指定区分 
 	-- 確認書№********************************
    || '","' || 	残高確認書ＮＯ 
 	-- 注文主コード********************************
    || '","' || 	注文主コード
 	-- 注文主会社コード********************************
    || '","' || 	注文主会社コード 
 	-- 注文主名称漢字********************************
    || '","' || 	concat(concat(注文主会社名称漢字, ' '), 注文主事業所名称漢字) 
 	-- 受注元コード********************************
    || '","' || 	受注元コード 
 	-- 受注元名称********************************
    || '","' || 	受注元名称 
 	-- 事業部コード********************************
    || '","' || 	事業部コード
 	-- カンパニー名称********************************
    || '","' || 	カンパニー名称 
 	-- 当月末合計残高********************************
    || '","' || 	sum(売掛金邦貨合計残高) 
 	-- 郵便番号********************************
    || '","' || 	concat(concat(SUBSTR ( 郵便番号 , 1 , 3 ), '-'), SUBSTR ( 郵便番号 , 4 , 4 )) 
 	-- 送り先住所********************************
    || '","' || 	住所漢字 
 	-- 宛名********************************
    || '","' || 	''
--    || '","' || 	統計年月
    || '"'
FROM
DB_1.V_CONF_L CONFIRM
JOIN DB_1.V_CO_B_K BRANCH ON CONFIRM.注文主コード = BRANCH.取引先コード
and CONFIRM.統計年月 = '&1'
and CONFIRM.売掛金邦貨合計残高 <> 0
and CONFIRM.残高確認書指定区分 = '2'
group by(
'〒'
,'差異'
,'明細書'
,CONFIRM.残高確認書指定区分
,CONFIRM.残高確認書ＮＯ
,CONFIRM.注文主コード
,CONFIRM.注文主会社コード
,concat(concat(CONFIRM.注文主会社名称漢字, ' '), CONFIRM.注文主事業所名称漢字)
,CONFIRM.受注元コード
,CONFIRM.受注元名称
,CONFIRM.事業部コード
,CONFIRM.カンパニー名称
,concat(concat(SUBSTR ( BRANCH.郵便番号 , 1 , 3 ), '-'), SUBSTR ( BRANCH.郵便番号 , 4 , 4 ))
,BRANCH.住所漢字
,'宛名'
--,統計年月
);

SPOOL OFF

EXIT
